examples/camel-cxf-soap/src/test/resources/hello-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cxf="http://cxf.examples.camel.wildfly.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <cxf:sayHello>
            <arg0>John Doe</arg0>
        </cxf:sayHello>
    </soapenv:Body>
</soapenv:Envelope>
